=====================**PACKAGES-NAMES-of-EDA**=====================
1) PANDAS       : Data frame applications

2) Numpy        : numerical python All Math Applications

3) Matplotlib(Matplot liberary): used for plotting

4) Seaborn      : used for ploting

5) Plotly       : Used for ploting

6) Bokhe        : used for ploting
first 4 we use mainly
=====================PACKAGES-OF-MACHINE-LEARNING===============
7) sickit-learn   : sklearn

=====================DEEP LEARNING=============

8) Tensorflow   : Google (Developed by google)

9) Keras        : Google (Developed by google)

10) pytorch     : FaceBook(Developed by Facebook)

======================PACKAGES-of NLP==========
11)  Nltk       : Natural language tool kit

12) scipy

====================BERT==============
13) Transformers  : Hugging face (Google)

====================GOOGLE models============
14)Specific google packages

==============Azure ML===============
15)Azure Packages

==============GEN AI===========
16) gemini       : google

17) ChatGPT      : OpenAI
======================Langchain===================
18) LangChain Packages

**Create a dataframes using list**

In [ ]:
- list ==== dictonary

- dictionary ===lisrt

In [ ]:
$STEP-1$

Create a Data

In [2]:
import pandas as  pd
names=['Chinni','sowjanya','nanni']
pd.DataFrame()  # empty dataframe will be created (no rows & columns)

Empty DataFrame
Columns: []
Index: []

In [ ]:
$STEP-2$
**Provide the Data**

In [3]:
names=['Chinni','sowjanya','nanni']
pd.DataFrame(names)

          0
0    Chinni
1  sowjanya
2     nanni

In [6]:
names=['Chinni','sowjanya','nanni']
age=[20,25,30]
pd.DataFrame(names,age)

           0
20    Chinni
25  sowjanya
30     nanni

In [9]:
names=['Chinni','sowjanya','nanni']
age=[20,25,30]
city=['Hyd','Mumbai','Delhi']
pd.DataFrame(zip(names,age),city)

# when we do zipping that will consider as full Data
# What  is the first position argument : Data
# second position argument : index

               0   1
Hyd       Chinni  20
Mumbai  sowjanya  25
Delhi      nanni  30

In [10]:
names=['Chinni','sowjanya','nanni']
age=[20,25,30]
city=['Hyd','Mumbai','Delhi']
data=zip(names,age)
pd.DataFrame(data,city)

               0   1
Hyd       Chinni  20
Mumbai  sowjanya  25
Delhi      nanni  30

In [ ]:
$Step-3$
- Provide the column name or number

In [16]:
names=['Chinni','sowjanya','nanni']
age=[20,25,30]
city=['Hyd','Mumbai','Delhi']
pd.DataFrame(zip(names,age,city),columns=['Names','Age','City'])

      Names  Age    City
0    Chinni   20     Hyd
1  sowjanya   25  Mumbai
2     nanni   30   Delhi

In [19]:
names=['Chinni','sowjanya','nanni']
age=[20,25,30]
pd.DataFrame(zip(names,age),columns=['Names','Age'])

      Names  Age
0    Chinni   20
1  sowjanya   25
2     nanni   30

In [20]:
names=['Chinni','sowjanya','nanni']
age=[20,25,30]
city=['Hyd','Mumbai','Delhi']
data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
pd.DataFrame(data,columns=cols)

      Names  Age    City
0    Chinni   20     Hyd
1  sowjanya   25  Mumbai
2     nanni   30   Delhi

In [29]:
names=['Chinni','sowjanya','nanni']
age=[20,25,30]
city=['Hyd','Mumbai','Delhi']
data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
df=pd.DataFrame(data,columns=cols)  # df is important to change r update the data
df

      Names  Age    City
0    Chinni   20     Hyd
1  sowjanya   25  Mumbai
2     nanni   30   Delhi

In [22]:
type(df)

pandas.core.frame.DataFrame

$Step-4$
- Very very important

- 
$ ADD -new- column $

- If u want to add new column
  
- first u need to check the number of rows in already existed data

- For example in above the dataframe has 3 rows

- u Need to create a new list with 3 Rows

- That list equate to the DataFrame

In [24]:
job=['Data science','Data Engineering','Computer Science']
df['Job']=job
df

      Names  Age    City               Job
0    Chinni   20     Hyd      Data science
1  sowjanya   25  Mumbai  Data Engineering
2     nanni   30   Delhi  Computer Science

$Ster-5$
# Update the already existing Data
- create

In [25]:
df['Age']=[35,40,45]
df

      Names  Age    City               Job
0    Chinni   35     Hyd      Data science
1  sowjanya   40  Mumbai  Data Engineering
2     nanni   45   Delhi  Computer Science

$Step-6$

**Change the index**

In [30]:
names=['Chinni','sowjanya','nanni','Shobha']
age=[20,25,30,45]
city=['Hyd','Mumbai','Delhi','Goa']

data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df
# no of list = no of columns
# no of value in the list  =no of rows

      Names  Age    City
A    Chinni   20     Hyd
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

**Note**

- Number of list = Number Of columns

- Number of values in list = Number of rows

- When u create the data all the lists will be in same length

$Step-7$

-

In [34]:
df.shape

# Matrix format
# 4 rows and 3 columns

print("The no of rows = " ,df.shape[0]) # simple tuple
print("The no of columns = " ,df.shape[1])

The no of rows =  4
The no of columns =  3

$Step-8$

**Drop the column**

- In order to drop column we required 3 arguments

- Columns name

       - The columns name we need to mention 
- axis 
       - axis=0 **represents rows**
       - axis=1  **represents columns**(imp in interviews)

- inplace
       - we r drop columns means we are modifying the data frame
       - so this modification we want to save in same variable or different varibles
       - If u want to keep in the same varible the (**inplace=True**)

In [35]:
# droping the city
names=['Chinni','sowjanya','nanni','Shobha']
age=[20,25,30,45]
city=['Hyd','Mumbai','Delhi','Goa']

data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Names  Age    City
A    Chinni   20     Hyd
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

In [38]:
df.drop('City',
       axis=1,
       inplace=True)
df

      Names  Age
A    Chinni   20
B  sowjanya   25
C     nanni   30
D    Shobha   45

In [43]:
df1=df.drop('Age',
       axis=1)  # if we won't give (inplace=True) the data will drop but it will not update for later
df1

      Names
A    Chinni
B  sowjanya
C     nanni
D    Shobha

In [44]:
df

      Names  Age
A    Chinni   20
B  sowjanya   25
C     nanni   30
D    Shobha   45

In [46]:
# Drill
names=['Chinni','sowjanya','nanni','Shobha']
age=[20,25,30,45]
city=['Hyd','Mumbai','Delhi','Goa']

data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Names  Age    City
A    Chinni   20     Hyd
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

In [50]:
df.drop('City',
       axis=1,
        inplace=True)
df

      Names  Age
A    Chinni   20
B  sowjanya   25
C     nanni   30
D    Shobha   45

In [53]:
# without giving  inplace=True
df.drop('Age',
       axis=1)

      Names
A    Chinni
B  sowjanya
C     nanni
D    Shobha

In [54]:
# it doesnot change the previous data
df

      Names  Age
A    Chinni   20
B  sowjanya   25
C     nanni   30
D    Shobha   45

In [55]:
df1=df.drop('Age',
       axis=1)
df1 # even we use df1 will not update .

      Names
A    Chinni
B  sowjanya
C     nanni
D    Shobha

In [70]:
# to use False


names=['Chinni','sowjanya','nanni','Shobha']
age=[20,25,30,45]
city=['Hyd','Mumbai','Delhi','Goa']

data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Names  Age    City
A    Chinni   20     Hyd
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

In [61]:
# if we won't give True it will take as false
df.drop('City',
       axis=1,
        inplace=False)
df # false will not chanfe the data

      Names  Age    City
A    Chinni   20     Hyd
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

In [71]:
df.drop(['Age','City'],axis=1,inplace=True)
df

      Names
A    Chinni
B  sowjanya
C     nanni
D    Shobha

$Step-10$

**Droping rows**

In [68]:
names=['Chinni','sowjanya','nanni','Shobha']
age=[20,25,30,45]
city=['Hyd','Mumbai','Delhi','Goa']

data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Names  Age    City
A    Chinni   20     Hyd
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

In [69]:
df.drop('A',
        axis=0,
       inplace=True)
df

      Names  Age    City
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

$STEP-11$

**How to save the data frame**

- Generally data frames are twom types

- Csv(comma seperated value)

- Excel

In [79]:
names=['Chinni','sowjanya','nanni','Shobha']
age=[20,25,30,45]
city=['Hyd','Mumbai','Delhi','Goa']

data=zip(names,age,city)
cols=['Names','Age','City']  # taking columns in seperate field like cols and now calling columns
idx=['A','B','C','D']
df=pd.DataFrame(data,
                index=idx,
                columns=cols)
df

      Names  Age    City
A    Chinni   20     Hyd
B  sowjanya   25  Mumbai
C     nanni   30   Delhi
D    Shobha   45     Goa

In [81]:
# File name = data
# Extention = .csv
df.to_csv('data.csv')

In [82]:
df.to_csv('data.csv')
df.to_csv('data.csv',index=False)

In [83]:
# Extension
# .Xlsx

In [87]:
df.to_excel('data2.xlsx',index=False) #If we r doing in excel it will take more kb(storage) so plz use csv